# FailureDefinitionAccessor Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FailureDefinitionAccessor Properties
FailureDefinitionAccessor Class See Also
---
The FailureDefinitionAccessor type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FailureDefinitionAccessor Class
Autodesk.Revit.DB Namespace